In [81]:
#for handling tables of data within python
import pandas

#for connection to and communication to the posgres database
import psycopg2
from psycopg2 import Error

#for making data visualizations for the reports
import plotnine

In [27]:
#store the general connection info
un = "postgres"
pw = "cs425proj"
db = "erp"

In [3]:
#check to see if db tables exist. if not, create tables
required_tables = ['inventory']

try:
    connection = psycopg2.connect(user = un,
                                  password = pw,
                                  host = "127.0.0.1",
                                  port = "5432",
                                  database = db)

    cursor = connection.cursor()
    
### Using three single quotes allows us to write multiline strings.  This is just easier to read
    
    for tab in required_tables:
        query = "SELECT * FROM " + tab + ";"
        print(query)
# # run the query
        try cursor.execute(query):
            print("Table exists in PostgreSQL ")
        except:
            create_query = 
    # commit the results
    connection.commit()

except (Exception, psycopg2.DatabaseError) as error :
    print ("Error while creating PostgreSQL table", error)
finally:
    #closing database connection.
    if(connection):
        cursor.close()
        connection.close()
        print("PostgreSQL connection is closed")

SyntaxError: invalid syntax (<ipython-input-3-6a2df606d84e>, line 19)

In [ ]:
#check to see if user roles exist. if not, create roles

In [ ]:
#check to see if users exist. if not, create users

In [ ]:
#ask terminal for username and password

In [ ]:
#look up role for user

In [ ]:
#if user does not exist, throw error

In [ ]:
#if user exists, show available actions given role

In [82]:
inventory = pandas.read_csv('../erp_app/Data/inventory.csv')
inventory

   inventoryID  cost  leadTime categoryType  amount
0          101   100        10        small     100
1          102   200        10          big      75
2          103   500        90      medium       25
3          104    50         5        small     200
4          105   600        60          big      15

In [83]:
model = pandas.read_csv('../erp_app/Data/model.csv')
model

   modelNumber  salePrice  inventoryID
0         1001        150          101
1         1002        220          102
2         1003        550          103
3         1004        100          104
4         1005        625          105

In [84]:
inventory.merge(model)

   inventoryID  cost  leadTime categoryType  amount  modelNumber  salePrice
0          101   100        10        small     100         1001        150
1          102   200        10          big      75         1002        220
2          103   500        90      medium       25         1003        550
3          104    50         5        small     200         1004        100
4          105   600        60          big      15         1005        625

In [85]:
employee = pandas.read_csv('../erp_app/Data/employee.csv')
employee
employee.query('Department == "Sales"')

,employeeID,FirstName,MiddleName,LastName,Salary,Salaried,Hourly,Department
1,10002,Sherman,Ken,Yip,45000,True,False,Sales
3,10004,Sahas,Karl,Johnson,45000,True,False,Sales
4,10005,Sudeep,Sunil,Harlow,55000,True,False,Sales
7,10008,Tim,B,Crisp,55000,True,False,Sales
9,10010,Tyrone,Carter,Mayfield,45000,True,False,Sales

In [86]:
customer = pandas.read_csv('../erp_app/Data/customer.csv')
customer

   customerID FirstName    LastName
0           1     Sunni        Lynn
1           2    Carrie  Armbruster
2           3      Anke   Dabrowski
3           4     Roman      Cooper
4           5   Tameeka       Jones
5           6    Hunter       Patel
6           7     Jacob        Rose
7           8       Kim         Lee
8           9         R     Bonesly
9          10      Zach      Herper

In [87]:
order = pandas.read_csv('../erp_app/Data/order.csv')
order

    orderNumber  customerID  employeeID  modelNumber  saleValue
0        100001          10       10002         1001        150
1        100006           2       10005         1001        150
2        100014           7       10004         1001        150
3        100019           2       10010         1001        150
4        100002           9       10002         1004        100
5        100004           7       10002         1004        100
6        100005           1       10004         1004        100
7        100007           3       10008         1004        100
8        100010           6       10005         1004        100
9        100013           6       10008         1004        100
10       100015           3       10005         1004        100
11       100016           4       10005         1004        100
12       100003           8       10002         1002        220
13       100008           4       10004         1003        550
14       100017           5       10010         1003        550
15       100018           2       10010         1003        550
16       100009           5       10008         1005        625
17       100011          10       10008         1005        625
18       100012           5       10004         1005        625

In [88]:
employeeLogin = pandas.read_csv('../erp_app/Data/employeelogin.csv')
employeeLogin

   employeeID     userID      role
0       10001     sgreen  engineer
1       10002       syip     sales
2       10003       skim  engineer
3       10004   sjohnson     sales
4       10005    sharlow     sales
5       10006  smohammad     admin
6       10007   ssampson     admin
7       10008     tcrisp     sales
8       10009     tnovak  engineer
9       10010  tmayfield     sales

In [48]:
employeeLogin = pandas.merge(employeeLogin,employee[['employeeID','Department']])
employeeLogin.head()

   Unnamed: 0  Unnamed: 0.1  employeeID    userID      role   Department
0           0             0       10001    sgreen  engineer  Engineering
1           1             1       10002      syip     sales        Sales
2           2             2       10003      skim  engineer  Engineering
3           3             3       10004  sjohnson     sales        Sales
4           4             4       10005   sharlow     sales        Sales

In [51]:
employeeLogin.loc[employeeLogin['Department'] == "Sales", 'role'] = 'sales'
employeeLogin.loc[employeeLogin['Department'] == "Information Technology", 'role'] = 'admin'
employeeLogin.loc[employeeLogin['Department'] == "Engineering", 'role'] = 'engineer'
employeeLogin.head()
employeeLogin.drop('Department', axis=1, inplace=True)
employeeLogin.head()

KeyError: 'Department'

In [54]:
employeeLogin.drop('Unnamed: 0', axis=1, inplace=True)
employeeLogin.drop('Unnamed: 0.1', axis=1, inplace=True)
employeeLogin.head()

   employeeID    userID      role
0       10001    sgreen  engineer
1       10002      syip     sales
2       10003      skim  engineer
3       10004  sjohnson     sales
4       10005   sharlow     sales

In [55]:
employeeLogin.to_csv('../erp_app/Data/employeelogin.csv',index = False)

In [89]:
order['employeeID'].head()
employee['employeeID'].head()
customer['customerID'].head()
order['customerID'].head()


pandas.merge(order,employee,on='employeeID')

,orderNumber,customerID,employeeID,modelNumber,saleValue,FirstName,MiddleName,LastName,Salary,Salaried,Hourly,Department
0,100001,10,10002,1001,150,Sherman,Ken,Yip,45000,True,False,Sales
1,100002,9,10002,1004,100,Sherman,Ken,Yip,45000,True,False,Sales
2,100004,7,10002,1004,100,Sherman,Ken,Yip,45000,True,False,Sales
3,100003,8,10002,1002,220,Sherman,Ken,Yip,45000,True,False,Sales
4,100006,2,10005,1001,150,Sudeep,Sunil,Harlow,55000,True,False,Sales
5,100010,6,10005,1004,100,Sudeep,Sunil,Harlow,55000,True,False,Sales
6,100015,3,10005,1004,100,Sudeep,Sunil,Harlow,55000,True,False,Sales
7,100016,4,10005,1004,100,Sudeep,Sunil,Harlow,55000,True,False,Sales
8,100014,7,10004,1001,150,Sahas,Karl,Johnson,45000,True,False,Sales
9,100005,1,10004,1004,100,Sahas,Karl,Johnson,45000,True,False,Sales
10,100008,4,10004,1003,550,Sahas,Karl,Johnson,45000,True,False,Sales
11,100012,5,10004,1005,625,Sahas,Karl,Johnson,45000,True,False,Sales
12,100019,2,10010,1001,150,Tyrone,Carter,Mayfield,45000,True,False,Sales
13,100017,5,10010,1003,550,Tyrone,Carter,Mayfield,45000,True,False,Sales
14,100018,2,10010,1003,550,Tyrone,Carter,Mayfield,45000,True,False,Sales
15,100007,3,10008,1004,100,Tim,B,Crisp,55000,True,False,Sales
16,100013,6,10008,1004,100,Tim,B,Crisp,55000,True,False,Sales
17,100009,5,10008,1005,625,Tim,B,Crisp,55000,True,False,Sales
18,100011,10,10008,1005,625,Tim,B,Crisp,55000,True,False,Sales

In [90]:
pandas.merge(pandas.merge(order,model), inventory).head()

,orderNumber,customerID,employeeID,modelNumber,saleValue,salePrice,inventoryID,cost,leadTime,categoryType,amount
0,100001,10,10002,1001,150,150,101,100,10,small,100
1,100006,2,10005,1001,150,150,101,100,10,small,100
2,100014,7,10004,1001,150,150,101,100,10,small,100
3,100019,2,10010,1001,150,150,101,100,10,small,100
4,100002,9,10002,1004,100,100,104,50,5,small,200

In [91]:
order = pandas.merge(order,model[['modelNumber','salePrice']])
order.head()

   orderNumber  customerID  employeeID  modelNumber  saleValue  salePrice
0       100001          10       10002         1001        150        150
1       100006           2       10005         1001        150        150
2       100014           7       10004         1001        150        150
3       100019           2       10010         1001        150        150
4       100002           9       10002         1004        100        100

In [92]:
order['saleValue'] = order['salePrice']

In [93]:
order.head()
order.drop('salePrice', axis=1, inplace=True)
order.head()

   orderNumber  customerID  employeeID  modelNumber  saleValue
0       100001          10       10002         1001        150
1       100006           2       10005         1001        150
2       100014           7       10004         1001        150
3       100019           2       10010         1001        150
4       100002           9       10002         1004        100

In [94]:
order.to_csv('../erp_app/Data/order.csv',index = False)

In [ ]:
pandas.merge(order,model[['modelNumber','salePrice']])

In [ ]:
# Admin report #1: total revenue from sale, assoc employee and customer
orderNumber = str(10001)
pandas.merge(pandas.merge(order,employee, on="employeeID"), customer, on="customerID").query('orderNumber == ' + orderNumber)

In [95]:
unpwd = employeeLogin
unpwd.head()

   employeeID    userID      role
0       10001    sgreen  engineer
1       10002      syip     sales
2       10003      skim  engineer
3       10004  sjohnson     sales
4       10005   sharlow     sales

In [96]:
unpwd.drop(['employeeID'],axis = 1, inplace = True)

In [97]:
unpwd['pw'] = 'p@ssw0rd'

In [98]:
unpwd.to_csv('../erp_app/Data/unpwd.csv',index = False)

In [99]:
unpwd.head()

     userID      role        pw
0    sgreen  engineer  p@ssw0rd
1      syip     sales  p@ssw0rd
2      skim  engineer  p@ssw0rd
3  sjohnson     sales  p@ssw0rd
4   sharlow     sales  p@ssw0rd

In [100]:

un = 'sgreen'
unpwd.query('userID == "' + str(un) + '"')['pw']
pw = 'p@ssw0rd'
if unpwd.query('userID == "' + str(un) + '"')['pw'][0] == pw:
    print(True)

True

In [101]:
if un in unpwd['userID']:
    print(True)

In [102]:
if 'sgreen' in list(unpwd['userID']):
    print(True)

True

In [103]:
user_info = unpwd

In [165]:
def login_user():
    user_info = pandas.read_csv("../erp_app/Data/unpwd.csv")

    login = False
    while login == False:
        un = input("Enter your username: ")
        print(un)
        if un in list(user_info['userID']):
            pw = input("Enter your password: ")
            print(pw)
#             print(user_info.query('userID == "' + str(un) + '"'))
            if user_info.loc[user_info['userID'] == str(un), 'pw'].values == pw:
                login = True
    #               print(list(user_info.query('userID == "' + str(un) + '"')))
            else:
                print('Incorrect. ')
        else:
            print("User name not found.  Try again.")
    return user_info.loc[user_info['userID'] == str(un)].values.tolist()
# print(list(thing.loc[0]))

In [149]:
print(user_info.head())
# user_info.loc['userID == "' + str(un) + '"','pw']
# user_info.loc[useuser_info.loc[user_info['userID'] == str(un)].indexr_info['userID'] == str(un), 'pw'] == 'p@ssw0rd'
idx = user_info.loc[user_info['userID'] == str(un)].index
idx
user_info.iloc[idx].values.tolist()
# list(user_info.loc[user_info.loc[user_info['userID'] == str(un)].index])

     userID      role        pw
0    sgreen  engineer  p@ssw0rd
1      syip     sales  p@ssw0rd
2      skim  engineer  p@ssw0rd
3  sjohnson     sales  p@ssw0rd
4   sharlow     sales  p@ssw0rd

[['sgreen', 'engineer', 'p@ssw0rd']]

In [164]:
user_info.loc[user_info['userID'] == str(un), 'pw'].values == pw

array([ True])

In [167]:
print(login_user())

Enter your username: syip
syip
Enter your password: sgreen
sgreen
Incorrect.
Enter your username: syip
syip
Enter your password: p@ssw0rd
p@ssw0rd
[['syip', 'sales', 'p@ssw0rd']]

In [193]:
[results] = login_user()

un = results[0]
role = results[1]
pw = results[2]

query = """DO
            $do$
            BEGIN
               IF NOT EXISTS (
                  SELECT FROM pg_catalog.pg_user  -- SELECT list can be empty for this
                  WHERE  usename = """ + un + """") THEN

                  CREATE user """ + un + """ with role """ + role + """ LOGIN PASSWORD '""" + pw + """"' ;
               END IF;
            END
            $do$;"""

try:
    connection = psycopg2.connect(user = un,
                                  password = pw,
                                  host = "127.0.0.1",
                                  port = "5432",
                                  database = "erp")
    print("Cool, we found your username in the database")
    cursor = connection.cursor()
except:
    print("Okay, so you're in our records, but not in the database.  We'll add you as a user real quick.")
    try:
        connection = psycopg2.connect(user = "postgres",
                                  password = "cs425proj",
                                  host = "127.0.0.1",
                                  port = "5432",
                                  database = "erp")
        cursor = connection.cursor()
        cursor.execute(query)
        print("User created")
        connection.commit()
    except (Exception, psycopg2.DatabaseError) as error :
        print ("Error while creating PostgreSQL table", error)
finally:
    #closing database connection.
        if(connection):
            cursor.close()
            connection.close()
            print("PostgreSQL connection is closed")

Enter your username: smohammad
smohammad
Enter your password: p@ssw0rd
p@ssw0rd
Okay, so you're in our records, but not in the database.  We'll add you as a user real quick.
User created
PostgreSQL connection is closed

In [174]:
username = results[0]
role = results[1]
password = results[2]

def check_db_user(username,role,password):
    query = '''DO
                $do$
                BEGIN
                   IF NOT EXISTS (
                      SELECT FROM pg_catalog.pg_user  -- SELECT list can be empty for this
                      WHERE  usename = "''' + username + '''") THEN

                      CREATE user "''' + username + '''" with ''' + role + ''' LOGIN PASSWORD "''' + password + '''" ;
                   END IF;
                END
                $do$;'''

    try:
        connection = psycopg2.connect(user = username,
                                      password = password,
                                      host = "127.0.0.1",
                                      port = "5432",
                                      database = "erp")
        print("Cool, we found your username in the database")
        cursor = connection.cursor()
    except:
        print("Okay, so you're in our records, but not in the database.  We'll add you as a user real quick.")
        try:
            connection = psycopg2.connect(user = "postgres",
                                      password = "cs425proj",
                                      host = "127.0.0.1",
                                      port = "5432",
                                      database = "erp")
            cursor = connection.cursor()
            cursor.execute(query)
            print("User created")
            connection.commit()
        except (Exception, psycopg2.DatabaseError) as error :
            print ("Error while creating PostgreSQL table", error)
    finally:
        #closing database connection.
            if(connection):
                cursor.close()
                connection.close()
                print("PostgreSQL connection is closed")

In [181]:
print(employeeLogin)
[results] = login_user()
username = results[0]
role = results[1]
password = results[2]

check_db_user(username,role,password)

      userID      role        pw
0     sgreen  engineer  p@ssw0rd
1       syip     sales  p@ssw0rd
2       skim  engineer  p@ssw0rd
3   sjohnson     sales  p@ssw0rd
4    sharlow     sales  p@ssw0rd
5  smohammad     admin  p@ssw0rd
6   ssampson     admin  p@ssw0rd
7     tcrisp     sales  p@ssw0rd
8     tnovak  engineer  p@ssw0rd
9  tmayfield     sales  p@ssw0rd
Enter your username: sgreen
sgreen
Enter your password: p@ssw0rd
p@ssw0rd
Cool, we found your username in the database
PostgreSQL connection is closed